# taps
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'homebrew/services'

# binaries
brew 'coreutils' # those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'mas'


brew 'pipx'

# development
brew 'go'
brew 'rust'
brew 'mysql', restart_service: true
brew 'node'
brew 'redis', restart_service: true
brew 'wget'

# apps
cask 'gpg-suite'
cask 'postman'
cask 'visual-studio-code'
cask 'google-chrome'

# mac app store
mas 'Bear', id: 1091189122
mas 'Slack', id: 618783545